tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1579_tdd.h
#define IOCCF5                        522
#define IOCCF6                        523
#define IOCCF7                        524
#define CWG1DBR0                      525
#define CWG1DBR                       526
#define CWG1DBR1                      527
#define CWG1DBR2                      528
#define CWG1DBR3                      529
#define CWG1DBR4                      530
#define CWG1DBR5                      531
#define CWG1DBF                       532
#define CWG1DBF0                      533
#define CWG1DBF1                      534
#define CWG1DBF2                      535
#define CWG1DBF3                      536
#define CWG1DBF4                      537
#define CWG1DBF5                      538
#define CWG1CON0                      539
#define G1CS0                         540
#define G1CS                          541
#define G1POLA                        542
#define G1POLB                        543
#define G1OEA                         544
#define G1OEB                         545
#define G1EN                          546
#define CWG1CON1                      547
#define G1IS0                         548
#define G1IS                          549
#define G1IS1                         550
#define G1IS2                         551
#define G1ASDLA                       552
#define G1ASDLA0                      553
#define G1ASDLA1                      554
#define G1ASDLB                       555
#define G1ASDLB0                      556
#define G1ASDLB1                      557
#define CWG1CON2                      558
#define G1ASDSPPS                     559
#define G1ASDSC1                      560
#define G1ASDSC2                      561
#define G1ARSEN                       562
#define G1ASE                         563
#define PWMEN                         564
#define MPWM1EN                       565
#define PWM1EN_A                      566
#define MPWM2EN                       567
#define PWM2EN_A                      568
#define MPWM3EN                       569
#define PWM3EN_A                      570
#define PWM4EN_A                      571
#define PWMLD                         572
#define MPWM1LD                       573
#define PWM1LDA_A                     574
#define MPWM2LD                       575
#define PWM2LDA_A                     576
#define PWM3LDA_A                     577
#define MPWM3LD                       578
#define PWM4LDA_A                     579
#define PWMOUT                        580
#define PWM1OUT_A                     581
#define MPWM1OUT                      582
#define MPWM2OUT                      583
#define PWM2OUT_A                     584
#define MPWM3OUT                      585
#define PWM3OUT_A                     586
#define PWM4OUT_A                     587
#define PWM1PHL                       588
#define PWM1PHL0                      589
#define PWM1PHL_PH                    590
#define PWM1PHL1                      591
#define PWM1PHL2                      592
#define PWM1PHL3                      593
#define PWM1PHL4                      594
#define PWM1PHL5                      595
#define PWM1PHL6                      596
#define PWM1PHL7                      597
#define PWM1PHH                       598
#define PWM1PHH0                      599
#define PWM1PHH_PH                    600
#define PWM1PHH1                      601
#define PWM1PHH2                      602
#define PWM1PHH3                      603
#define PWM1PHH4                      604
#define PWM1PHH5                      605
#define PWM1PHH6                      606
#define PWM1PHH7                      607
#define PWM1DCL_DC                    608
#define PWM1DCL                       609
#define PWM1DCL0                      610
#define PWM1DCL1                      611
#define PWM1DCL2                      612
#define PWM1DCL3                      613
#define PWM1DCL4                      614
#define PWM1DCL5                      615
#define PWM1DCL6                      616
#define PWM1DCL7                      617
#define PWM1DCH_DC                    618
#define PWM1DCH                       619
#define PWM1DCH0                      620
#define PWM1DCH1                      621
#define PWM1DCH2                      622
#define PWM1DCH3                      623
#define PWM1DCH4                      624
#define PWM1DCH5                      625
#define PWM1DCH6                      626
#define PWM1DCH7                      627
#define PWM1PRL                       628
#define PWM1PRL0                      629
#define PWM1PRL_PR                    630
#define PWM1PRL1                      631
#define PWM1PRL2                      632
#define PWM1PRL3                      633
#define PWM1PRL4                      634
#define PWM1PRL5                      635
#define PWM1PRL6                      636
#define PWM1PRL7                      637
#define PWM1PRH                       638
#define PWM1PRH_PR                    639
#define PWM1PRH0                      640
#define PWM1PRH1                      641
#define PWM1PRH2                      642
#define PWM1PRH3                      643
#define PWM1PRH4                      644
#define PWM1PRH5                      645
#define PWM1PRH6                      646
#define PWM1PRH7                      647
#define PWM1OFL0                      648
#define PWM1OFL_OF                    649
#define PWM1OFL                       650
#define PWM1OFL1                      651
#define PWM1OFL2                      652
#define PWM1OFL3                      653
#define PWM1OFL4                      654
#define PWM1OFL5                      655
#define PWM1OFL6                      656
#define PWM1OFL7                      657
#define PWM1OFH_OF                    658
#define PWM1OFH                       659
#define PWM1OFH0                      660
#define PWM1OFH1                      661
#define PWM1OFH2                      662
#define PWM1OFH3                      663
#define PWM1OFH4                      664
#define PWM1OFH5                      665
#define PWM1OFH6                      666
#define PWM1OFH7                      667
#define PWM1TMRL0                     668
#define PWM1TMRL_TMR                  669
#define PWM1TMRL                      670
#define PWM1TMRL1                     671
#define PWM1TMRL2                     672
#define PWM1TMRL3                     673
#define PWM1TMRL4                     674
#define PWM1TMRL5                     675
#define PWM1TMRL6                     676
#define PWM1TMRL7                     677
#define PWM1TMRH                      678
#define PWM1TMRH0                     679
#define PWM1TMRH_TMR                  680
#define PWM1TMRH1                     681
#define PWM1TMRH2                     682
#define PWM1TMRH3                     683
#define PWM1TMRH4                     684
#define PWM1TMRH5                     685
#define PWM1TMRH6                     686
#define PWM1TMRH7                     687
#define PWM1CON                       688
#define PWM1CON_MODE                  689
#define PWM1MODE0                     690
#define PWM1MODE                      691
#define PWM1CON_MODE0                 692
#define PWM1MODE1                     693
#define PWM1CON_MODE1                 694
#define PWM1CON_POL                   695
#define PWM1POL                       696
#define PWM1CON_OUT                   697
#define PWM1OUT                       698
#define PWM1OE                        699
#define PWM1CON_OE                    700
#define PWM1EN                        701
#define PWM1CON_EN                    702
#define PWM1INTE                      703
#define PWM1PRIE                      704
#define PWM1INTE_PRIE                 705
#define PWM1DCIE                      706
#define PWM1INTE_DCIE                 707
#define PWM1INTE_PHIE                 708
#define PWM1PHIE                      709
#define PWM1OFIE                      710
#define PWM1INTE_OFIE                 711
#define PWM1INTF                      712
#define PWM1INTF_PRIF                 713
#define PWM1PRIF                      714
#define PWM1INTF_DCIF                 715
#define PWM1DCIF                      716
#define PWM1PHIF                      717
#define PWM1INTF_PHIF                 718
#define PWM1OFIF                      719
#define PWM1INTF_OFIF                 720
#define PWM1CLKCON                    721
#define PWM1CLKCON_CS                 722
#define PWM1CS                        723
#define PWM1CLKCON_CS0                724
#define PWM1CS0                       725
#define PWM1CLKCON_CS1                726
#define PWM1CS1                       727
#define PWM1CLKCON_PS0                728
#define PWM1PS                        729
#define PWM1PS0                       730
#define PWM1CLKCON_PS                 731
#define PWM1PS1                       732
#define PWM1CLKCON_PS1                733
#define PWM1PS2                       734
#define PWM1CLKCON_PS2                735
#define PWM1LDCON                     736
#define PWM1LDCON_LDS0                737
#define PWM1LDS                       738
#define PWM1LDCON_LDS                 739
#define PWM1LDS0                      740
#define PWM1LDCON_LDS1                741
#define PWM1LDS1                      742
#define PWM1LDCON_LDT                 743
#define PWM1LDM                       744
#define PWM1LD                        745
#define PWM1LDCON_LDA                 746
#define PWM1OFCON                     747
#define PWM1OFCON_OFS0                748
#define PWM1OFS                       749
#define PWM1OFCON_OFS                 750
#define PWM1OFS0                      751
#define PWM1OFCON_OFS1                752
#define PWM1OFS1                      753
#define PWM1OFMC                      754
#define PWM1OFCON_OFO                 755
#define PWM1OFM0                      756
#define PWM1OFM                       757
#define PWM1OFCON_OFM0                758
#define PWM1OFCON_OFM                 759
#define PWM1OFM1                      760
#define PWM1OFCON_OFM1                761
#define PWM2PHL_PH                    762
#define PWM2PHL0                      763
#define PWM2PHL                       764
#define PWM2PHL1                      765
#define PWM2PHL2                      766
#define PWM2PHL3                      767
#define PWM2PHL4                      768
#define PWM2PHL5                      769
#define PWM2PHL6                      770
#define PWM2PHL7                      771
#define PWM2PHH0                      772
#define PWM2PHH                       773
#define PWM2PHH_PH                    774
#define PWM2PHH1                      775
#define PWM2PHH2                      776
#define PWM2PHH3                      777
#define PWM2PHH4                      778
#define PWM2PHH5                      779
#define PWM2PHH6                      780
#define PWM2PHH7                      781
#define PWM2DCL_DC                    782
#define PWM2DCL0                      783
#define PWM2DCL                       784
#define PWM2DCL1                      785
#define PWM2DCL2                      786
#define PWM2DCL3                      787
#define PWM2DCL4                      788
#define PWM2DCL5                      789
#define PWM2DCL6                      790
#define PWM2DCL7                      791
#define PWM2DCH0                      792
#define PWM2DCH_DC                    793
#define PWM2DCH                       794
#define PWM2DCH1                      795
#define PWM2DCH2                      796
#define PWM2DCH3                      797
#define PWM2DCH4                      798
#define PWM2DCH5                      799
#define PWM2DCH6                      800
#define PWM2DCH7                      801
#define PWM2PRL0                      802
#define PWM2PRL_PR                    803
#define PWM2PRL                       804
#define PWM2PRL1                      805
#define PWM2PRL2                      806
#define PWM2PRL3                      807
#define PWM2PRL4                      808
#define PWM2PRL5                      809
#define PWM2PRL6                      810
#define PWM2PRL7                      811
#define PWM2PRH0                      812
#define PWM2PRH                       813
#define PWM2PRH_PR                    814
#define PWM2PRH1                      815
#define PWM2PRH2                      816
#define PWM2PRH3                      817
#define PWM2PRH4                      818
#define PWM2PRH5                      819
#define PWM2PRH6                      820
#define PWM2PRH7                      821
#define PWM2OFL                       822
#define PWM2OFL_OF                    823
#define PWM2OFL0                      824
#define PWM2OFL1                      825
#define PWM2OFL2                      826
#define PWM2OFL3                      827
#define PWM2OFL4                      828
#define PWM2OFL5                      829
#define PWM2OFL6                      830
#define PWM2OFL7                      831
#define PWM2OFH                       832
#define PWM2OFH0                      833
#define PWM2OFH_OF                    834
#define PWM2OFH1                      835
#define PWM2OFH2                      836
#define PWM2OFH3                      837
#define PWM2OFH4                      838
#define PWM2OFH5                      839
#define PWM2OFH6                      840
#define PWM2OFH7                      841
#define PWM2TMRL_TMR                  842
#define PWM2TMRL0                     843
#define PWM2TMRL                      844
#define PWM2TMRL1                     845
#define PWM2TMRL2                     846
#define PWM2TMRL3                     847
#define PWM2TMRL4                     848
#define PWM2TMRL5                     849
#define PWM2TMRL6                     850
#define PWM2TMRL7                     851
#define PWM2TMRH_TMR                  852
#define PWM2TMRH                      853
#define PWM2TMRH0                     854
#define PWM2TMRH1                     855
#define PWM2TMRH2                     856
#define PWM2TMRH3                     857
#define PWM2TMRH4                     858
#define PWM2TMRH5                     859
#define PWM2TMRH6                     860
#define PWM2TMRH7                     861
#define PWM2CON                       862
#define PWM2MODE0                     863
#define PWM2MODE                      864
#define PWM2CON_MODE0                 865
#define PWM2CON_MODE                  866
#define PWM2MODE1                     867
#define PWM2CON_MODE1                 868
#define PWM2POL                       869
#define PWM2CON_POL                   870
#define PWM2CON_OUT                   871
#define PWM2OUT                       872
#define PWM2OE                        873
#define PWM2CON_OE                    874
#define PWM2EN                        875
#define PWM2CON_EN                    876
#define PWM2INTE                      877
#define PWM2INTE_PRIE                 878
#define PWM2PRIE                      879
#define PWM2INTE_DCIE                 880
#define PWM2DCIE                      881
#define PWM2INTE_PHIE                 882
#define PWM2PHIE                      883
#define PWM2INTE_OFIE                 884
#define PWM2OFIE                      885
#define PWM2INTF                      886
#define PWM2INTF_PRIF                 887
#define PWM2PRIF                      888
#define PWM2INTF_DCIF                 889
#define PWM2DCIF                      890
#define PWM2INTF_PHIF                 891
#define PWM2PHIF                      892
#define PWM2INTF_OFIF                 893
#define PWM2OFIF                      894
#define PWM2CLKCON                    895
#define PWM2CS0                       896
#define PWM2CS                        897
#define PWM2CLKCON_CS0                898
#define PWM2CLKCON_CS                 899
#define PWM2CLKCON_CS1                900
#define PWM2CS1                       901
#define PWM2CLKCON_PS                 902
#define PWM2CLKCON_PS0                903
#define PWM2PS0                       904
#define PWM2PS                        905
#define PWM2PS1                       906
#define PWM2CLKCON_PS1                907
#define PWM2PS2                       908
#define PWM2CLKCON_PS2                909
#define PWM2LDCON                     910
#define PWM2LDCON_LDS0                911
#define PWM2LDS0                      912
#define PWM2LDCON_LDS                 913
#define PWM2LDS                       914
#define PWM2LDS1                      915
#define PWM2LDCON_LDS1                916
#define PWM2LDM                       917
#define PWM2LDCON_LDT                 918
#define PWM2LD                        919
#define PWM2LDCON_LDA                 920
#define PWM2OFCON                     921
#define PWM2OFS                       922
#define PWM2OFS0                      923
#define PWM2OFCON_OFS0                924
#define PWM2OFCON_OFS                 925
#define PWM2OFCON_OFS1                926
#define PWM2OFS1                      927
#define PWM2OFMC                      928
#define PWM2OFCON_OFO                 929
#define PWM2OFCON_OFM0                930
#define PWM2OFM                       931
#define PWM2OFCON_OFM                 932
#define PWM2OFM0                      933
#define PWM2OFCON_OFM1                934
#define PWM2OFM1                      935
#define PWM3PHL                       936
#define PWM3PHL_PH                    937
#define PWM3PHL0                      938
#define PWM3PHL1                      939
#define PWM3PHL2                      940
#define PWM3PHL3                      941
#define PWM3PHL4                      942
#define PWM3PHL5                      943
#define PWM3PHL6                      944
#define PWM3PHL7                      945
#define PWM3PHH0                      946
#define PWM3PHH                       947
#define PWM3PHH_PH                    948
#define PWM3PHH1                      949
#define PWM3PHH2                      950
#define PWM3PHH3                      951
#define PWM3PHH4                      952
#define PWM3PHH5                      953
#define PWM3PHH6                      954
#define PWM3PHH7                      955
#define PWM3DCL_DC                    956
#define PWM3DCL0                      957
#define PWM3DCL                       958
#define PWM3DCL1                      959
#define PWM3DCL2                      960
#define PWM3DCL3                      961
#define PWM3DCL4                      962
#define PWM3DCL5                      963
#define PWM3DCL6                      964
#define PWM3DCL7                      965
#define PWM3DCH_DC                    966
#define PWM3DCH0                      967
#define PWM3DCH                       968
#define PWM3DCH1                      969
#define PWM3DCH2                      970
#define PWM3DCH3                      971
#define PWM3DCH4                      972
#define PWM3DCH5                      973
#define PWM3DCH6                      974
#define PWM3DCH7                      975
#define PWM3PRL0                      976
#define PWM3PRL                       977
#define PWM3PRL_PR                    978
#define PWM3PRL1                      979
#define PWM3PRL2                      980
#define PWM3PRL3                      981
#define PWM3PRL4                      982
#define PWM3PRL5                      983
#define PWM3PRL6                      984
#define PWM3PRL7                      985
#define PWM3PRH0                      986
#define PWM3PRH_PR                    987
#define PWM3PRH                       988
#define PWM3PRH1                      989
#define PWM3PRH2                      990
#define PWM3PRH3                      991
#define PWM3PRH4                      992
#define PWM3PRH5                      993
#define PWM3PRH6                      994
#define PWM3PRH7                      995
#define PWM3OFL_OF                    996
#define PWM3OFL0                      997
#define PWM3OFL                       998
#define PWM3OFL1                      999
#define PWM3OFL2                      1000
#define PWM3OFL3                      1001
#define PWM3OFL4                      1002
#define PWM3OFL5                      1003
#define PWM3OFL6                      1004
#define PWM3OFL7                      1005
#define PWM3OFH_OF                    1006
#define PWM3OFH0                      1007
#define PWM3OFH                       1008
#define PWM3OFH1                      1009
#define PWM3OFH2                      1010
#define PWM3OFH3                      1011
#define PWM3OFH4                      1012
#define PWM3OFH5                      1013
#define PWM3OFH6                      1014
#define PWM3OFH7                      1015
#define PWM3TMRL0                     1016
#define PWM3TMRL                      1017
#define PWM3TMRL_TMR                  1018
#define PWM3TMRL1                     1019
#define PWM3TMRL2                     1020
#define PWM3TMRL3                     1021
#define PWM3TMRL4                     1022
#define PWM3TMRL5                     1023
#define PWM3TMRL6                     1024
#define PWM3TMRL7                     1025
#define PWM3TMRH0                     1026
#define PWM3TMRH_TMR                  1027
#define PWM3TMRH                      1028
#define PWM3TMRH1                     1029
#define PWM3TMRH2                     1030
#define PWM3TMRH3                     1031
#define PWM3TMRH4                     1032
#define PWM3TMRH5                     1033
#define PWM3TMRH6                     1034
#define PWM3TMRH7                     1035
#define PWM3CON                       1036
#define PWM3CON_MODE0                 1037
#define PWM3MODE                      1038
#define PWM3CON_MODE                  1039
#define PWM3MODE0                     1040
#define PWM3CON_MODE1                 1041
#define PWM3MODE1                     1042
#define PWM3CON_POL                   1043
#define PWM3POL                       1044
#define PWM3CON_OUT                   1045
#define PWM3OUT                       1046
#define PWM3OE                        1047
#define PWM3CON_OE                    1048
#define PWM3EN                        1049
#define PWM3CON_EN                    1050
#define PWM3INTE                      1051
#define PWM3PRIE                      1052
#define PWM3INTE_PRIE                 1053
#define PWM3INTE_DCIE                 1054
#define PWM3DCIE                      1055
#define PWM3PHIE                      1056
#define PWM3INTE_PHIE                 1057
#define PWM3INTE_OFIE                 1058
#define PWM3OFIE                      1059
#define PWM3INTF                      1060
#define PWM3PRIF                      1061
#define PWM3INTF_PRIF                 1062
#define PWM3INTF_DCIF                 1063
#define PWM3DCIF                      1064
#define PWM3INTF_PHIF                 1065
#define PWM3PHIF                      1066
#define PWM3INTF_OFIF                 1067
#define PWM3OFIF                      1068
#define PWM3CLKCON                    1069
#define PWM3CLKCON_CS                 1070
#define PWM3CS                        1071
#define PWM3CS0                       1072
#define PWM3CLKCON_CS0                1073
#define PWM3CS1                       1074
#define PWM3CLKCON_CS1                1075
#define PWM3PS0                       1076
#define PWM3CLKCON_PS                 1077
#define PWM3CLKCON_PS0                1078
#define PWM3PS                        1079
#define PWM3PS1                       1080
#define PWM3CLKCON_PS1                1081
#define PWM3PS2                       1082
#define PWM3CLKCON_PS2                1083
#define PWM3LDCON                     1084
#define PWM3LDCON_LDS                 1085
#define PWM3LDS0                      1086
#define PWM3LDS                       1087
#define PWM3LDCON_LDS0                1088
#define PWM3LDS1                      1089
#define PWM3LDCON_LDS1                1090
